<?php

namespace Database\Factories\admin;

use App\Models\admin\Tag;
use Illuminate\Database\Eloquent\Factories\Factory;

class TagFactory extends Factory
{
    /**
     * The name of the factory's corresponding model.
     *
     * @var string
     */
    protected $model = Tag::class;

    /**
     * Define the model's default state.
     *
     * @return array
     */
    public function definition()
    {
        $str = 'भौतिकशास्त्रमा प्राप्त उपलब्धिहरूले प्रविधि विकास र अर्थतन्त्रमा पुर्‍याउने योगदान त छँदै छ, भौतिक विज्ञानका खासखास सिद्धान्तहरू अर्थशास्त्रको व्याख्यामा पनि उपयोगी देखिएकाले अर्थशास्त्र र भौतिकशास्त्रलाई मिलाएर नयाँ शब्दावली प्रयोगमा ल्याइएको छ— ‘इकोनोफिजिक्स’ भौतिकशास्त्री युजिन स्ट्यान्लीले सन् १९९५ मा जटिल प्रणालीहरूको गतिशीलतासम्बन्धी कोलकाता सम्मेलनमा यो शब्द पहिलो पटक प्रयोग गरेका थिए बजारको गतिशीलता र सम्पत्ति–आम्दानीको वितरण पद्धतिको अध्ययनमा इकोनोफिजिक्स निकै उपयोगी पाइएको सम्बद्ध अर्थशास्त्री र भौतिकशास्त्रीहरूको दाबी छ डिसेम्बर २०१७ मा अमेरिकन इकोनोमिक एसोसिएसन (एईए) ले इकोनोफिजिक्सबारे आयोजना गरेको सम्मेलनलाई एउटा महत्त्वपूर्ण कदमका रूपमा लिँदै यी दुवै विधा मिलाएर गरिएका अध्ययनहरू वित्तीय संकट हल गर्न उपयोगी हुने बताइएको थियो इकोनोफिजिक्स अवधारणा त्यति पुरानो नभए पनि युरोप र अमेरिकाका केही विश्वविद्यालयमा यसको पढाइ हुँदै आएको छ नेपालमा पनि सन् २०१५ देखि त्रिभुवन विश्वविद्यालयमा पढाउन थालिएको छ अर्थशास्त्रलाई समाज विज्ञानको भौतिकशास्त्र पनि भन्ने गरिन्छ जसरी सूक्ष्म कणदेखि ब्रह्माण्डका ठूलठूला पिण्डसम्मलाई गति दिन ऊर्जाको प्रयोग भएको हुन्छ भन्दै भौतिकशास्त्रमा ऊर्जालाई नै आधार मानेर प्राकृतिक प्रक्रियाहरूको व्याख्या गरिन्छ, त्यसरी नै पुँजीले सामाजिक गतिविधिहरू पैदा गराउँछ भन्ने मान्यताअनुसार अर्थशास्त्रमा सामाजिक प्रक्रियाहरूको व्याख्या हुने गर्छ भौतिक विज्ञानका थुप्रै समीकरण अर्थशास्त्रका क्षेत्रमा पनि उस्तै किसिमले लागू हुन सक्ने देखिन्छ, भलै भौतिक विज्ञानमा प्रयोग हुने भौतिक परिमाण र अर्थशास्त्रमा प्रयोग हुने परिमाण बुझाउने शब्द र सूचक फरक हुन सक्छन्';
        $nepaliWord = explode(" ",$str);
        $nepaliWord = array_unique($nepaliWord);
        $tag = $nepaliWord[array_rand($nepaliWord)];
        return [
            'name' => $tag,
            'slug' => $tag,
        ];
    }
}
