


    <?php include ('layouts/headertwo.php'); ?>

    <div class="whiteBg">
        <div class="container">
            <h2 class="hamroBarey">हाम्रो बारे</h2>
            <p class="hamroBareyText">छैटौं नेपालगन्ज म्याराथन सम्पन्न भएकाे छ । यसपटक नेपालगन्ज म्याराथनकाे उपाधि सशस्त्र प्रहरीका गोपीचन्द्र पार्कीले हात पारेका छन् । निर्धारित दूरी २ घण्टा १८ मिनेट ५९ सेकेन्डमा पूरा गरेर शनिबार बिहान भएको प्रतिस्पर्धामा पार्की पहिलो भएका हुन्  । उनी १३ औं सागका स्वर्णपदक विजेता पनि हुन् । नेपालगन्ज म्याराथनमा प्रथम भएका पार्की जापानको टोकियोमा हुने ओलम्पिकमा सहभागी हुनेछन् । नेपाल सम्वत ११४१ को आवागमनलाई कीर्तिपुरको थां बहा:मा विभिन्न सांस्कृतिक झाँकीहरुसहित मनाइएको छ । कोभीड- १९ महामारीका कारण यो वर्ष सुरक्षाको सम्पुर्ण मापदण्ड अप्नाएर कम मानिसहरुको उपस्तिथिमा छोटो समयमा सकिने गरि मनाइएको स्थानीयले बताएका छन् । चक्रपथको कंलकी-चाबहिल सडक विस्तारको क्रममा विश्व सम्पदामा सूचिकृत संरचना भत्काउन लागिएको भन्दै शनिबार बौद्धमा विरोध प्रदर्शन गरिएको छ । 'स्वयम्भू विश्वसम्पदा क्षेत्र बचाऔं' अभियानले शनिबार बौद्धमा दिप प्रज्वलन गर्दै विरोध गरेको हो । सम्पदा बचाउ अभियान्ताहरुले शनिबार एकैसाथ बौद्धसहित स्वयम्भू र लुम्बिनीमा पनि दिप प्रज्वलन गरेका थिए । लोरेम इप्सुम इस सिम्प्ल्री दुम्म्री टेक्स्ट ओफ थे पृन्तीनग एन्ड टाईपसेत्तीनग इन्दुस्त्ॠ । लोरेम इप्सुम हस बीन थे इन्दुस्त्र्य्’स स्तन्दर्द दुम्म्री टेक्स्ट एवेर सिन्के थे १५००स्, व्हेन अन उन्क्नोव्न पृन्तेर तूक अ गल्लेरी ओफ टाईप एन्ड स्क्रम्ब्लेद इत तो मेक अ टाईप स्पेकिमेन बूक । इत हस सुर्विवेद नोत ओन्ल्री फिवे केन्तुरिएस्, बुत अल्सो थे लेअप इन्तो ईलेक्त्रोनिक टाईपसेत्तीनग्, रेमैनिङ एस्सेन्तिअल्ल्री उन्चेन्जद । इत वस पोपुलरिसेद इन थे १९६०स विथ थे रेलेअसे ओफ लेत्रसेत शीत्स कोन्तैनिङ लोरेम इप्सुम पस्सगेस्, एन्ड मोरे रेकेन्त्ल्री विथ डेस्कतोप पुब्लिशिङ सफ्टवेर लिके अल्दुस पेजमेकर इन्क्लुदिङ वेर्सनस ओफ लोरेम इप्सुम लोरेम इप्सुम इस सिम्प्ल्री दुम्म्री टेक्स्ट ओफ थे पृन्तीनग एन्ड टाईपसेत्तीनग इन्दुस्त्ॠ । लोरेम इप्सुम हस बीन थे इन्दुस्त्र्य्’स स्तन्दर्द दुम्म्री टेक्स्ट एवेर सिन्के थे १५००स्, व्हेन अन उन्क्नोव्न पृन्तेर तूक अ गल्लेरी ओफ टाईप एन्ड स्क्रम्ब्लेद इत तो मेक अ टाईप स्पेकिमेन बूक । इत हस सुर्विवेद नोत ओन्ल्री फिवे केन्तुरिएस्, बुत अल्सो थे लेअप इन्तो ईलेक्त्रोनिक टाईपसेत्तीनग्, रेमैनिङ एस्सेन्तिअल्ल्री उन्चेन्जद । इत वस पोपुलरिसेद इन थे १९६०स विथ थे रेलेअसे ओफ लेत्रसेत शीत्स कोन्तैनिङ लोरेम इप्सुम पस्सगेस्, एन्ड मोरे रेकेन्त्ल्री विथ डेस्कतोप पुब्लिशिङ सफ्टवेर लिके अल्दुस पेजमेकर इन्क्लुदिङ वेर्सनस ओफ लोरेम इप्सुम </p>
            <div class="row">
                <div class="col-md-6 findUsOn">     
                    <h5>Find Us On:</h5>
                </div>
                <div class="col-md-6 findSocial">
                    <ul class="findUs">
                        <li><a href="#"><img src="img\home-facebook.png" alt="facebook" class="img-fluid"></a></li>
                        <li><a href="#"><img src="img\home-twitter1.png" alt="facebook" class="img-fluid"></a></li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
    
    <?php include ('layouts/footer-two.php'); ?>
    